@zamanh Thanks for the report. I've just tested your configuration against my local Artifactory instance (7.98.9) and did not get the error.

```sh
alexh@alexh-mac terraform-provider-platform % terraform apply

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # artifactory_local_generic_repository.test-repo will be created
  + resource "artifactory_local_generic_repository" "test-repo" {
      + blacked_out          = false
      + cdn_redirect         = false
      + description          = "Test repository"
      + id                   = (known after apply)
      + includes_pattern     = "**/*"
      + key                  = "test-repo-2"
      + package_type         = (known after apply)
      + priority_resolution  = false
      + project_environments = (known after apply)
      + repo_layout_ref      = "simple-default"
      + xray_index           = false
    }

  # artifactory_managed_user.test-user will be created
  + resource "artifactory_managed_user" "test-user" {
      + admin                      = false
      + disable_ui_access          = true
      + email                      = "test@rt.com"
      + groups                     = [
          + "my-group",
        ]
      + id                         = (known after apply)
      + internal_password_disabled = false
      + name                       = "test-user"
      + password                   = (sensitive value)
      + profile_updatable          = true
    }

  # platform_group.my-group will be created
  + resource "platform_group" "my-group" {
      + admin_privileges = false
      + auto_join        = true
      + description      = "My group"
      + name             = "my-group"
      + realm            = (known after apply)
      + realm_attributes = (known after apply)
    }

  # platform_permission.my-permission will be created
  + resource "platform_permission" "my-permission" {
      + artifact = {
          + actions = {
              + groups = [
                  + {
                      + name        = "my-group"
                      + permissions = [
                          + "READ",
                          + "WRITE",
                        ]
                    },
                ]
              + users  = []
            }
          + targets = [
              + {
                  + include_patterns = [
                      + "**",
                    ]
                  + name             = "test-repo-2"
                },
            ]
        }
      + name     = "my-permission-name"
    }

Plan: 4 to add, 0 to change, 0 to destroy.
╷
│ Warning: Missing MyJFrog API Token
│
│   with provider["registry.terraform.io/jfrog/platform"],
│   on sample.tf line 14, in provider "platform":
│   14: provider "platform" {
│
│ MyJFrog API Token was not found in the JFROG_MYJFROG_API_TOKEN environment variable or provider configuration block myjfrog_api_token attribute. MyJFrog
│ functionality will be affected.
╵

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

platform_group.my-group: Creating...
artifactory_local_generic_repository.test-repo: Creating...
platform_group.my-group: Creation complete after 0s [name=my-group]
artifactory_managed_user.test-user: Creating...
artifactory_local_generic_repository.test-repo: Creation complete after 0s [id=test-repo-2]
platform_permission.my-permission: Creating...
artifactory_managed_user.test-user: Creation complete after 0s [id=test-user]
platform_permission.my-permission: Creation complete after 0s [name=my-permission-name]
╷
│ Warning: Missing MyJFrog API Token
│
│   with provider["registry.terraform.io/jfrog/platform"],
│   on sample.tf line 14, in provider "platform":
│   14: provider "platform" {
│
│ MyJFrog API Token was not found in the JFROG_MYJFROG_API_TOKEN environment variable or provider configuration block myjfrog_api_token attribute. MyJFrog
│ functionality will be affected.
╵

Apply complete! Resources: 4 added, 0 changed, 0 destroyed.
```